flow-over-heated-plate-partitioned-flow/fluid1-openfoam/system/preciceDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      preciceDict;
}

preciceConfig "../precice-config.xml";

participant Fluid1;

modules (CHT FF);

interfaces
{
  Interface1
  {
    mesh              Fluid1-Solid-Mesh;
    patches           (interface);
    
    readData
    (
      Heat-Flux
    );
    
    writeData
    (
      Temperature-Solid
    );
  };

  Interface2
  {
    mesh              Fluid1-Fluid-Mesh;
    patches           (outlet);
    
    readData
    (
      Pressure
      VelocityGradient
      FlowTemperatureGradient      
    );
    
    writeData
    (
      Velocity
      FlowTemperature-Fluid
    );
  };
};

FF
{
  nameP     p_rgh;
}
